Performance/Results/2026-09-16-macos-c64-repeat/1-hummingbird-stream-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/stream
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.55ms  473.76us  17.97ms   92.96%
    Req/Sec     3.53k   143.28     3.68k    92.65%
  Latency Distribution
     50%    4.52ms
     75%    4.69ms
     90%    4.86ms
     99%    5.42ms
  71627 requests in 5.10s, 1.10GB read
Requests/sec:  14041.71
Transfer/sec:    220.46MB

METRICS {"requests":71627,"duration_us":5101017,"bytes":1179220351,"p50_us":4517,"p99_us":5417,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}