Performance/Results/2026-09-16-macos-c64-repeat/1-vapor-large-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/large
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.71ms  455.24us  18.64ms   89.48%
    Req/Sec     9.28k   345.43     9.93k    77.45%
  Latency Distribution
     50%    1.67ms
     75%    1.78ms
     90%    1.94ms
     99%    3.60ms
  188304 requests in 5.10s, 11.51GB read
Requests/sec:  36915.23
Transfer/sec:      2.26GB

METRICS {"requests":188304,"duration_us":5100984,"bytes":12356320259,"p50_us":1671,"p99_us":3602,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}