Performance/Results/2026-09-16-macos-c64-repeat/1-vapor-stream-warmup.txt
Running 3s test @ http://127.0.0.1:18080/bench/stream
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.61ms    1.25ms  52.81ms   83.41%
    Req/Sec     3.48k   320.83     5.59k    88.52%
  Latency Distribution
     50%    4.63ms
     75%    5.04ms
     90%    5.52ms
     99%    8.56ms
  42216 requests in 3.10s, 661.37MB read
Requests/sec:  13617.92
Transfer/sec:    213.34MB

METRICS {"requests":42216,"duration_us":3100033,"bytes":693499618,"p50_us":4630,"p99_us":8561,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}