Performance/Results/2026-09-16-macos-c64-repeat/1-vapor-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms    0.92ms  24.06ms   94.08%
    Req/Sec    14.86k     1.53k   17.15k    74.38%
  Latency Distribution
     50%    0.94ms
     75%    1.21ms
     90%    1.69ms
     99%    4.26ms
  300168 requests in 5.10s, 23.19MB read
Requests/sec:  58853.19
Transfer/sec:      4.55MB

METRICS {"requests":300168,"duration_us":5100284,"bytes":24313608,"p50_us":943,"p99_us":4256,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}