Performance/Results/2026-09-16-macos-c64-repeat/1-vapor4-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.88ms  616.29us  15.89ms   93.31%
    Req/Sec    19.03k     2.53k   39.48k    91.09%
  Latency Distribution
     50%  772.00us
     75%    0.88ms
     90%    1.28ms
     99%    2.55ms
  382464 requests in 5.10s, 51.79MB read
Requests/sec:  74990.87
Transfer/sec:     10.16MB

METRICS {"requests":382464,"duration_us":5100141,"bytes":54309888,"p50_us":772,"p99_us":2551,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}