Performance/Results/2026-09-16-macos-c64-repeat/2-vapor4-stream-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/stream
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.05ms  740.83us  12.51ms   75.15%
    Req/Sec     2.65k   134.86     3.62k    93.60%
  Latency Distribution
     50%    6.03ms
     75%    6.44ms
     90%    6.93ms
     99%    8.06ms
  53512 requests in 5.10s, 841.52MB read
Requests/sec:  10493.01
Transfer/sec:    165.01MB

METRICS {"requests":53512,"duration_us":5099778,"bytes":882400630,"p50_us":6029,"p99_us":8064,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}