Performance/Results/2026-09-16-macos-c64-repeat/2-vapor4-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms    3.51ms  64.42ms   98.63%
    Req/Sec    16.83k     2.60k   23.81k    77.50%
  Latency Distribution
     50%  830.00us
     75%    1.03ms
     90%    1.55ms
     99%    7.88ms
  336035 requests in 5.04s, 45.51MB read
Requests/sec:  66610.54
Transfer/sec:      9.02MB

METRICS {"requests":336035,"duration_us":5044772,"bytes":47716970,"p50_us":830,"p99_us":7880,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}