Performance/Results/2026-09-16-macos-c64-repeat/2-vapor4-tiny-warmup.txt
Running 3s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.87ms  298.40us   4.36ms   80.51%
    Req/Sec    18.46k     1.21k   20.45k    72.58%
  Latency Distribution
     50%  799.00us
     75%    0.92ms
     90%    1.26ms
     99%    1.88ms
  227670 requests in 3.10s, 30.83MB read
Requests/sec:  73438.03
Transfer/sec:      9.95MB

METRICS {"requests":227670,"duration_us":3100165,"bytes":32329140,"p50_us":799,"p99_us":1875,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}