Performance/Results/2026-09-16-macos-c64-repeat/3-hummingbird-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   730.58us   99.52us   4.42ms   85.81%
    Req/Sec    21.57k   523.99    22.48k    76.47%
  Latency Distribution
     50%  721.00us
     75%  764.00us
     90%  814.00us
     99%    1.07ms
  437768 requests in 5.10s, 49.26MB read
Requests/sec:  85833.51
Transfer/sec:      9.66MB

METRICS {"requests":437768,"duration_us":5100199,"bytes":51656624,"p50_us":721,"p99_us":1073,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}