Performance/Results/2026-09-16-macos-c64-repeat/3-vapor-json-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/json
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01ms  291.63us   7.92ms   80.84%
    Req/Sec    15.56k   469.77    17.43k    73.53%
  Latency Distribution
     50%    0.97ms
     75%    1.09ms
     90%    1.31ms
     99%    2.13ms
  315734 requests in 5.10s, 40.35MB read
Requests/sec:  61899.48
Transfer/sec:      7.91MB

METRICS {"requests":315734,"duration_us":5100754,"bytes":42308442,"p50_us":966,"p99_us":2127,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}