Performance/Results/2026-09-16-macos-c64-repeat/3-vapor-small-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/small
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  212.34us   3.60ms   86.02%
    Req/Sec    15.45k   467.00    16.86k    74.51%
  Latency Distribution
     50%    0.99ms
     75%    1.07ms
     90%    1.20ms
     99%    2.00ms
  313589 requests in 5.10s, 330.76MB read
Requests/sec:  61484.39
Transfer/sec:     64.85MB

METRICS {"requests":313589,"duration_us":5100303,"bytes":346829516,"p50_us":991,"p99_us":2002,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}