Performance/Results/2026-09-16-macos-c64-repeat/3-vapor4-stream-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/stream
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.25ms    0.87ms  11.71ms   71.41%
    Req/Sec     2.57k    81.34     2.79k    67.65%
  Latency Distribution
     50%    6.13ms
     75%    6.85ms
     90%    7.35ms
     99%    8.54ms
  52101 requests in 5.10s, 819.26MB read
Requests/sec:  10214.86
Transfer/sec:    160.62MB

METRICS {"requests":52101,"duration_us":5100511,"bytes":859059643,"p50_us":6133,"p99_us":8535,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}