Performance/Results/2026-09-16-macos-c64-repeat/3-vapor4-stream-warmup.txt
Running 3s test @ http://127.0.0.1:18080/bench/stream
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.34ms  805.18us  10.06ms   69.82%
    Req/Sec     2.53k    98.25     2.81k    79.84%
  Latency Distribution
     50%    6.25ms
     75%    6.93ms
     90%    7.36ms
     99%    8.43ms
  31173 requests in 3.10s, 490.22MB read
Requests/sec:  10052.80
Transfer/sec:    158.09MB

METRICS {"requests":31173,"duration_us":3100926,"bytes":514036194,"p50_us":6252,"p99_us":8432,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}